In [1]:
import pandas as pd

In [2]:
s = pd.Series(list('abcd'))

In [3]:
s

0    a
1    b
2    c
3    d
dtype: object

In [4]:
s = pd.Series(list('abcd'), [5, 6, 7, 8])

In [5]:
s

5    a
6    b
7    c
8    d
dtype: object

In [6]:
pd.Series(data = [1, 2, 3], index=list('abc'))

a    1
b    2
c    3
dtype: int64

In [8]:
pd.Series({'x': 1, 'y': 2})

x    1
y    2
dtype: int64

In [9]:
pd.Series({'x': 1, 'y': 'look a string'})

x                1
y    look a string
dtype: object

In [11]:
pd.Series({'x': 1, 'y': 'look a string'}, index=['x', 'x', 'z'])

x      1
x      1
z    NaN
dtype: object

In [12]:
s

5    a
6    b
7    c
8    d
dtype: object

In [13]:
s.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [14]:
s.index

Int64Index([5, 6, 7, 8], dtype='int64')

In [15]:
s = pd.Series([1,2, 3, 4], list('abcd'))

In [16]:
s[0]

1

In [17]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
s[1]

2

In [19]:
s['b']

2

In [20]:
s2 = pd.Series(list('abcd'))

In [21]:
s2

0    a
1    b
2    c
3    d
dtype: object

In [22]:
s2[-1]

KeyError: -1

In [23]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [24]:
s[-1]

4

In [25]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [26]:
s[['a', 'b']]

a    1
b    2
dtype: int64

In [27]:

s[['a', 'a', 'a', 'b']]

a    1
a    1
a    1
b    2
dtype: int64

In [28]:
s3 = pd.Series([2, 3, 4, 5], index=list("aabc"))

In [29]:
s3

a    2
a    3
b    4
c    5
dtype: int64

In [30]:
s3['a']

a    2
a    3
dtype: int64

In [31]:
s3

a    2
a    3
b    4
c    5
dtype: int64

In [32]:
s3[:3]

a    2
a    3
b    4
dtype: int64

In [34]:
s3[:'b']

a    2
a    3
b    4
dtype: int64

In [35]:
s2

0    a
1    b
2    c
3    d
dtype: object

In [36]:
s2[:3]

0    a
1    b
2    c
dtype: object

In [37]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [38]:
s + 1

a    2
b    3
c    4
d    5
dtype: int64

In [39]:
s < 3

a     True
b     True
c    False
d    False
dtype: bool

In [40]:
s = pd.Series([1, 2], ['x', 'y'])
s + pd.Series([9, 100], ['x', 'z']) # tricky!

x    10.0
y     NaN
z     NaN
dtype: float64

In [41]:
s2

0    a
1    b
2    c
3    d
dtype: object

In [42]:
s2[[True, False, True, False]]

0    a
2    c
dtype: object

In [43]:
s

x    1
y    2
dtype: int64

In [44]:
s3

a    2
a    3
b    4
c    5
dtype: int64

In [45]:
s3 < 4

a     True
a     True
b    False
c    False
dtype: bool

In [46]:
s3[s3 < 4]

a    2
a    3
dtype: int64

In [47]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [48]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=['r1', 'r2'], columns=list('abc'))

    a  b  c
r1  1  2  3
r2  4  5  6

In [51]:
df = pd.DataFrame({'col1': {'row1': 1, 'row2': 2},'col2': {'row1': 100, 'row2': 200}})

In [52]:
df

      col1  col2
row1     1   100
row2     2   200

In [53]:
df.values

array([[  1, 100],
       [  2, 200]])

In [54]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [55]:
df.index

Index(['row1', 'row2'], dtype='object')

In [62]:
df = pd.DataFrame([[4, 5, 6, 7], [8, 9, 10, 11]],
    columns=['foo', 'bar', 'baz', 'baz'])

In [63]:
df

   foo  bar  baz  baz
0    4    5    6    7
1    8    9   10   11

In [64]:
df['bar']

0    5
1    9
Name: bar, dtype: int64

In [65]:
try:
    df[0]
except KeyError:
    print('want column name plz')

want column name plz

In [66]:
df[['bar', 'baz']]

   bar  baz  baz
0    5    6    7
1    9   10   11

In [67]:
df['baz']

   baz  baz
0    6    7
1   10   11

In [68]:
s2

0    a
1    b
2    c
3    d
dtype: object

In [69]:
s2.name

In [70]:
s2.name = 'some stuff'

In [71]:
s2

0    a
1    b
2    c
3    d
Name: some stuff, dtype: object

In [72]:
df

   foo  bar  baz  baz
0    4    5    6    7
1    8    9   10   11

In [73]:
df['foo']

0    4
1    8
Name: foo, dtype: int64

In [74]:
df

   foo  bar  baz  baz
0    4    5    6    7
1    8    9   10   11

In [75]:
df[['baz', 'foo', 'bar']]

   baz  baz  foo  bar
0    6    7    4    5
1   10   11    8    9

In [76]:
df

   foo  bar  baz  baz
0    4    5    6    7
1    8    9   10   11

In [77]:
df

   foo  bar  baz  baz
0    4    5    6    7
1    8    9   10   11

In [78]:
df['foo']

0    4
1    8
Name: foo, dtype: int64

In [79]:
d = pd.DataFrame({"cA": {'r1': 1, 'r2': 2, 'r3': 3},
                  "cB": {'r1': 4, 'r2': 5, 'r3': 6},
                  "cC": {'r1': 7, 'r2': 8, 'r3': 9}})

In [80]:
d

    cA  cB  cC
r1   1   4   7
r2   2   5   8
r3   3   6   9

In [81]:
d['cA']

r1    1
r2    2
r3    3
Name: cA, dtype: int64

In [82]:
d['r1':'r2']

    cA  cB  cC
r1   1   4   7
r2   2   5   8

In [83]:
d[[True, False, True]]

    cA  cB  cC
r1   1   4   7
r3   3   6   9

* 1 element: col (or mult cols)
* a list: cols... as df
* a list of booleans: rows
* a slice: rows

In [84]:
d

    cA  cB  cC
r1   1   4   7
r2   2   5   8
r3   3   6   9

In [85]:
d['cB'] > 4

r1    False
r2     True
r3     True
Name: cB, dtype: bool

In [87]:
d[d['cB'] > 4] # give me all rows in data frame where column cb is greater than 4

    cA  cB  cC
r2   2   5   8
r3   3   6   9

In [89]:
d[d['cB'] > 4][['cA', 'cB']] # give me cols ca and cb . forrows in data frame where column cb is greater than 4

    cA  cB
r2   2   5
r3   3   6

In [90]:
s = pd.Series([2, 3, 4, 5, 6], list('abcde'))

In [91]:
s

a    2
b    3
c    4
d    5
e    6
dtype: int64

In [92]:
s['a'] = 100

In [93]:
s

a    100
b      3
c      4
d      5
e      6
dtype: int64

In [94]:
s[1:3] = 200

In [95]:
s

a    100
b    200
c    200
d      5
e      6
dtype: int64

In [96]:
s['f'] = 300

In [97]:
s

a    100
b    200
c    200
d      5
e      6
f    300
dtype: int64

In [98]:
del s['d']

In [99]:
s

a    100
b    200
c    200
e      6
f    300
dtype: int64

In [100]:
df = pd.DataFrame([[4, 5, 6], [7, 8, 9]],
    columns=['foo', 'bar', 'baz'])

In [101]:
df

   foo  bar  baz
0    4    5    6
1    7    8    9

In [102]:
df['bar'] = 'wat????'

In [103]:
df

   foo      bar  baz
0    4  wat????    6
1    7  wat????    9

In [104]:
df['foo'] = [99, 100]

In [105]:
df

   foo      bar  baz
0   99  wat????    6
1  100  wat????    9

In [106]:
df

   foo      bar  baz
0   99  wat????    6
1  100  wat????    9

In [107]:
df['baz'] = pd.Series([10, 11])

In [108]:
df

   foo      bar  baz
0   99  wat????   10
1  100  wat????   11

In [109]:
# TODO: check on this????;
df['baz'] = pd.Series([10, 11, 12, 13, 14])

In [110]:
df

   foo      bar  baz
0   99  wat????   10
1  100  wat????   11

In [111]:
df = pd.DataFrame([[4, 5, 6], [7, 8, 9]],
    index=['r1', 'r2'],
    columns=['foo', 'bar', 'baz'])
#     foo  bar  baz
# r1    4    5    6
# r2    7    8    9

In [112]:
df

    foo  bar  baz
r1    4    5    6
r2    7    8    9

In [113]:
df['foo'] = pd.Series([100, 200], ['r1', 'r3'])

In [114]:
df

      foo  bar  baz
r1  100.0    5    6
r2    NaN    8    9

In [115]:
d = pd.DataFrame({"cA": {'r1': 1, 'r2': 2, 'r3': 3},
                  "cB": {'r1': 4, 'r2': 5, 'r3': 6},
                  "cC": {'r1': 7, 'r2': 8, 'r3': 9}})

In [116]:
d

    cA  cB  cC
r1   1   4   7
r2   2   5   8
r3   3   6   9

In [119]:
d[d['cA'] > 1] = 0

In [120]:
d

    cA  cB  cC
r1   1   4   7
r2   0   0   0
r3   0   0   0

In [121]:
df = pd.DataFrame([[4, 5, 6], [7, 8, 9]],
    columns=['foo', 'bar', 'baz'])

In [122]:
df

   foo  bar  baz
0    4    5    6
1    7    8    9

In [124]:
df.drop('baz') # by default, drop assumes row (axis = 0)

KeyError: "labels ['baz'] not contained in axis"

In [125]:
df.drop('baz', axis=1) # by default, drop assumes row (axis = 0)

   foo  bar
0    4    5
1    7    8

In [126]:
df

   foo  bar  baz
0    4    5    6
1    7    8    9

In [127]:
df.drop('baz', axis=1, inplace=True)

In [128]:
df

   foo  bar
0    4    5
1    7    8

loc
iloc
properties on a data frame
* loc works with labels
* iloc works with position
* both work like numpy indexing

In [129]:
df

   foo  bar
0    4    5
1    7    8

In [132]:
# df[0] # does not work... grabs col (0 does not exist)
df.loc[0]

foo    4
bar    5
Name: 0, dtype: int64

In [133]:
df.loc[0, 'foo']

4

In [134]:
df

   foo  bar
0    4    5
1    7    8

In [135]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [136]:
df.columns

Index(['foo', 'bar'], dtype='object')

In [137]:
df.columns.union(['foo', 'baz', 'qux'])

Index(['bar', 'baz', 'foo', 'qux'], dtype='object')

In [138]:
df

   foo  bar
0    4    5
1    7    8

In [140]:
import numpy as np
df = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['r1', 'r2', 'r2'], columns=['a', 'a', 'b'])

In [141]:
df

    a  a  b
r1  0  1  2
r2  3  4  5
r2  6  7  8

In [142]:
df.columns

Index(['a', 'a', 'b'], dtype='object')

In [143]:
df.columns.union(['a', 'c'])

Index(['a', 'a', 'b', 'c'], dtype='object')

In [144]:
d = pd.DataFrame({"cA": {'r1': 1, 'r2': 2, 'r3': 3},
                  "cB": {'r1': 4, 'r2': 5, 'r3': 6},
                  "cC": {'r1': 7, 'r2': 8, 'r3': 9}})

In [145]:
d

    cA  cB  cC
r1   1   4   7
r2   2   5   8
r3   3   6   9

In [146]:
d.reindex(['r3', 'r4', 'r2'])

     cA   cB   cC
r3  3.0  6.0  9.0
r4  NaN  NaN  NaN
r2  2.0  5.0  8.0

In [147]:
d

    cA  cB  cC
r1   1   4   7
r2   2   5   8
r3   3   6   9

In [148]:
d.reindex(['r3', 'r4', 'r2'], columns=['cC', 'cC'])

     cC   cC
r3  9.0  9.0
r4  NaN  NaN
r2  8.0  8.0

In [149]:
d = [["$229.2", 2017, 123000, "$1100", "Cupertino, US"],
     ["$211.9", 2017, 320671, "$284", "Suwon, South Korea"],
     ["$177.8", 2017, 566000, "$985",  "Seattle, US"],
     ["$154.7", 2017, 1300000, "$66", "New Taipei City, Taiwan"],
     ["$110.8", 2017, 80110, "$834", "Mountain View, US"]]

comps = ["apple", "samsung", "amazon", "foxconn", "alphabet"]
cols = ["revenue", "fy", "employees", "mcap", "location"]

c = pd.DataFrame(d, index=comps, columns=cols)

In [151]:
c

         revenue    fy  employees   mcap                 location
apple     $229.2  2017     123000  $1100            Cupertino, US
samsung   $211.9  2017     320671   $284       Suwon, South Korea
amazon    $177.8  2017     566000   $985              Seattle, US
foxconn   $154.7  2017    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8  2017      80110   $834        Mountain View, US

In [155]:
c.drop('fy', axis=1, inplace=True)

KeyError: "labels ['fy'] not contained in axis"

In [156]:
c

         revenue  employees   mcap                 location
apple     $229.2     123000  $1100            Cupertino, US
samsung   $211.9     320671   $284       Suwon, South Korea
amazon    $177.8     566000   $985              Seattle, US
foxconn   $154.7    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8      80110   $834        Mountain View, US

In [157]:
c.drop('mcap', axis=1, inplace=True)

In [158]:
c

         revenue  employees                 location
apple     $229.2     123000            Cupertino, US
samsung   $211.9     320671       Suwon, South Korea
amazon    $177.8     566000              Seattle, US
foxconn   $154.7    1300000  New Taipei City, Taiwan
alphabet  $110.8      80110        Mountain View, US

In [159]:
c['employees']

apple        123000
samsung      320671
amazon       566000
foxconn     1300000
alphabet      80110
Name: employees, dtype: int64

In [160]:
c.loc[:, 'employees']

apple        123000
samsung      320671
amazon       566000
foxconn     1300000
alphabet      80110
Name: employees, dtype: int64

In [161]:
c

         revenue  employees                 location
apple     $229.2     123000            Cupertino, US
samsung   $211.9     320671       Suwon, South Korea
amazon    $177.8     566000              Seattle, US
foxconn   $154.7    1300000  New Taipei City, Taiwan
alphabet  $110.8      80110        Mountain View, US

In [162]:
c.iloc[2, 0]

'$177.8'